Core/src/src/Documents/КадровоеПеремещение/КадровоеПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровоеПеремещение</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ДниОтпускаСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияИУдержания</registerRecords>
  <registerRecords>InformationRegister.ДругиеВидыОтсутствия</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКадровоеПеремещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОтпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОтпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗанимаемыхСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчастникПенсионногоФонда</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетДобровольно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyDivision</name>
      <type>
        <types>CatalogRef.AzRyDivision</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтпуска</name>
      <type>
        <types>CatalogRef.ВидыОтпусков</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияУдержания</name>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>Актуальность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НалогиНаДоходы</name>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Актуальность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Enums/ВидыОперацийКадровоеПеремещение/ВидыОперацийКадровоеПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКадровоеПеремещение</name>
  <enumValues>
    <name>ПеремещениеИИзменениеСпособаОплаты</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСпособаОплаты</name>
  </enumValues>
  <enumValues>
    <name>СписаниеДнейОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ВидыОтпусков</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Documents/КадровоеПеремещение/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСлужебные

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКомандуПечати(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура изменяет текущую строку ТЧ Сотрудники
//
Процедура ИзменитьТекущегоСотрудника()
	
	Элементы.Сотрудники.ТекущаяСтрока = ТекущийСотрудник;
	
КонецПроцедуры // ИзменитьТекущегоСотрудника()

&НаСервере
// Функция вызывает функцию НайтиНачисленияУдержанияСотрудника объекта.
//
Функция НайтиНачисленияУдержанияСотрудникаСервер(СтруктураОтбора, Налог = Ложь)	
	
	Документ = РеквизитФормыВЗначение("Объект");
	РезультатПоиска = Документ.НайтиНачисленияУдержанияСотрудника(СтруктураОтбора, Налог);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
	Возврат РезультатПоиска;
	
КонецФункции

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры ДатаПриИзменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
Функция ПолучитьДанныеОрганизацияПриИзменении(Организация)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Компания", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

&НаСервере
// Заполняет значения ТЧ Сотрудники.
//
Процедура ЗаполнитьЗначения()
	
	Если Объект.Сотрудники.Количество() = 0 ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийКадровоеПеремещение.ИзменениеСпособаОплаты Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект.Сотрудники Цикл
		
		СтруктураСотрудник = Новый Структура;
		СтруктураСотрудник.Вставить("Период", СтрокаТЧ.Период - 1);
		СтруктураСотрудник.Вставить("Сотрудник", СтрокаТЧ.Сотрудник);
		СтруктураСотрудник.Вставить("Организация", Объект.Организация);
		СтруктураСотрудник.Вставить("Ссылка", Объект.Ссылка);//Паганини
		
		ПолучитьДанныеСотрудника(СтруктураСотрудник);
		
		СтрокаТЧ.ПрежнееПодразделение = СтруктураСотрудник.СтруктурнаяЕдиница;
		СтрокаТЧ.ПрежняяДолжность = СтруктураСотрудник.Должность;
		СтрокаТЧ.ПрежнееКоличествоЗанимаемыхСтавок = СтруктураСотрудник.ЗанимаемыхСтавок;
		СтрокаТЧ.ПрежнийГрафикРаботы = СтруктураСотрудник.ГрафикРаботы;
		
		//Паганини_
		СтрокаТЧ.ПрежнийУчастникПенсионногоФонда		= СтруктураСотрудник.УчастникПенсионногоФонда;
		СтрокаТЧ.ПрежнийВидУдержанияПФ					= СтруктураСотрудник.ВидУдержанияПФ;
		СтрокаТЧ.ПрежнийУчаствуетДобровольно			= СтруктураСотрудник.УчаствуетДобровольно;
		//_Паганини
		
	КонецЦикла;
	
КонецПроцедуры // 

&НаСервере
// Заполняет значения ТЧ Сотрудники.
//
Процедура ЗаполнитьЗначенияПоВсемСотрудникам()	
	
	Для каждого СтрокаТЧ Из Объект.Сотрудники Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ПрежнееПодразделение)
				ИЛИ ЗначениеЗаполнено(СтрокаТЧ.ПрежняяДолжность) Тогда
		
			СтруктураСотрудник = Новый Структура;
			СтруктураСотрудник.Вставить("Период", СтрокаТЧ.Период - 1);
			СтруктураСотрудник.Вставить("Сотрудник", СтрокаТЧ.Сотрудник);
			СтруктураСотрудник.Вставить("Организация", Объект.Организация);
			СтруктураСотрудник.Вставить("Ссылка", Объект.Ссылка);//Паганини
			
			ПолучитьДанныеСотрудника(СтруктураСотрудник);
			
			СтрокаТЧ.ПрежнееПодразделение = СтруктураСотрудник.СтруктурнаяЕдиница;
			СтрокаТЧ.ПрежняяДолжность = СтруктураСотрудник.Должность;
			СтрокаТЧ.ПрежнееКоличествоЗанимаемыхСтавок = СтруктураСотрудник.ЗанимаемыхСтавок;
			СтрокаТЧ.ПрежнийГрафикРаботы = СтруктураСотрудник.ГрафикРаботы;
			
			//Паганини_
			СтрокаТЧ.ПрежнийУчастникПенсионногоФонда		= СтруктураСотрудник.УчастникПенсионногоФонда;
			СтрокаТЧ.ПрежнийВидУдержанияПФ					= СтруктураСотрудник.ВидУдержанияПФ;
			СтрокаТЧ.ПрежнийУчаствуетДобровольно			= СтруктураСотрудник.УчаствуетДобровольно;
			//_Паганини
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // 

&НаСервереБезКонтекста
// Получает с сервера набор данных из РС Сотрудники.
//
Процедура ПолучитьДанныеСотрудника(СтруктураСотрудник)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СотрудникиСрезПоследних.СтруктурнаяЕдиница,
	|	СотрудникиСрезПоследних.Должность,
	|	СотрудникиСрезПоследних.ЗанимаемыхСтавок,
	//Паганини_
	|	СотрудникиСрезПоследних.УчастникПенсионногоФонда,
	|	СотрудникиСрезПоследних.ВидУдержанияПФ,
	|	СотрудникиСрезПоследних.УчаствуетДобровольно,
	//_Паганини
	|	СотрудникиСрезПоследних.ГрафикРаботы
	|,	СотрудникиСрезПоследних.ВидОтпуска КАК ВидОтпуска //+++ Дмгг
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&Период,
	|			Сотрудник = &Сотрудник
	//Паганини_
	|			И НЕ Регистратор = &Ссылка
	//_Паганини
	|				И Организация = &Организация) КАК СотрудникиСрезПоследних");
	
	Запрос.УстановитьПараметр("Период", СтруктураСотрудник.Период);
	Запрос.УстановитьПараметр("Сотрудник", СтруктураСотрудник.Сотрудник);
	Запрос.УстановитьПараметр("Организация", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(СтруктураСотрудник.Организация));
	Запрос.УстановитьПараметр("Ссылка", 	 СтруктураСотрудник.Ссылка);//Паганини
	
	СтруктураСотрудник.Вставить("СтруктурнаяЕдиница");
	СтруктураСотрудник.Вставить("Должность");
	СтруктураСотрудник.Вставить("ЗанимаемыхСтавок", 1);
	СтруктураСотрудник.Вставить("ГрафикРаботы");
	//Паганини_
	СтруктураСотрудник.Вставить("УчастникПенсионногоФонда");
	СтруктураСотрудник.Вставить("ВидУдержанияПФ");
	СтруктураСотрудник.Вставить("УчаствуетДобровольно");
	//_Паганини
	
	СтруктураСотрудник.Вставить("ВидОтпуска"); //+++ Дмгг
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураСотрудник, Выборка);
	КонецЦикла;
	
КонецПроцедуры // ПолучитьДанныеДатаПриИзменении()

&НаСервере
// Процедура заполняет список выбора управляющего поля Текущий сотрудник
//
Процедура ЗаполнитьСписокВыбораТекущихСотрудников()
	
	Элементы.ТекущийСотрудникНачисленияУдержания.СписокВыбора.Очистить();
	Элементы.ТекущийСотрудникНалоги.СписокВыбора.Очистить();
	Для каждого СтрокаСотрудник Из Объект.Сотрудники Цикл
		
		ПредставлениеСтроки = Строка(СтрокаСотрудник.Сотрудник) + НСтр("ka=', ТН: ';ru=', ТН: '") + Строка(СтрокаСотрудник.Сотрудник.Код);
		Элементы.ТекущийСотрудникНачисленияУдержания.СписокВыбора.Добавить(СтрокаСотрудник.ПолучитьИдентификатор(), ПредставлениеСтроки);
		Элементы.ТекущийСотрудникНалоги.СписокВыбора.Добавить(СтрокаСотрудник.ПолучитьИдентификатор(), ПредставлениеСтроки);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСписокВыбораТекущихСотрудников()

&НаСервере
// Процедура устанавливает доступность элементов формы на клиенте.
//
// Параметры:
//  Нет.
//
Процедура УстановитьВидимостьНаСервере()
	
	ЭтоКадровоеПеремещениеОклад = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты"));
	ЭтоСписаниеОтпусков			= (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКадровоеПеремещение.СписаниеДнейОтпуска")); //+++ Дмгг
	ЭтоВидыОтпусков				= (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКадровоеПеремещение.ВидыОтпусков")); //+++ Дмгг
	
	Элементы.СотрудникиПрежнийГрафикРаботы.Видимость 	= ЭтоКадровоеПеремещениеОклад;
	Элементы.СотрудникиПрежняяДолжность.Видимость 		= ЭтоКадровоеПеремещениеОклад;
	Элементы.СотрудникиПрежнееПодразделение.Видимость	= ЭтоКадровоеПеремещениеОклад;
	Элементы.СотрудникиГрафикРаботы.Видимость 			= ЭтоКадровоеПеремещениеОклад;
	Элементы.СотрудникиДолжность.Видимость 				= ЭтоКадровоеПеремещениеОклад;
	Элементы.СотрудникиСтруктурнаяЕдиница.Видимость 	= ЭтоКадровоеПеремещениеОклад;
	//Паганини ПФ_
	Элементы.ГруппаУчастникПенсионногоФонда.Видимость	= ЭтоКадровоеПеремещениеОклад;
	Элементы.ГруппаВидУдержанияПФ.Видимость 			= ЭтоКадровоеПеремещениеОклад;
	Элементы.ГруппаУчаствуетДобровольно.Видимость		= ЭтоКадровоеПеремещениеОклад;
	//_Паганини ПФ
	
	Если ЭтоКадровоеПеремещениеОклад Тогда
		
		Элементы.СотрудникиПрежнееКоличествоЗанимаемыхСтавок.Видимость	= ВестиШтатноеРасписание;
		Элементы.СотрудникиЗанимаемыхСтавок.Видимость					= ВестиШтатноеРасписание;
		
		Элементы.СотрудникиСтруктурнаяЕдиница.АвтоВыборНезаполненного 	= Истина;
		Элементы.СотрудникиДолжность.АвтоВыборНезаполненного 			= Истина;
		Элементы.СотрудникиЗанимаемыхСтавок.АвтоВыборНезаполненного 	= Истина;
		Элементы.СотрудникиСтруктурнаяЕдиница.АвтоОтметкаНезаполненного = Истина;
		Элементы.СотрудникиДолжность.АвтоОтметкаНезаполненного 			= Истина;
		Элементы.СотрудникиЗанимаемыхСтавок.АвтоОтметкаНезаполненного 	= Истина;
		
		//+++ Дмгг Таск ONESOFT-2766 08.12.22
		Элементы.СтраницаНачисленияУдержания.Видимость 					= Истина;
		Элементы.СтраницаНалоги.Видимость 								= Истина;
		Элементы.ГруппаСписанияОтпусков.Видимость 						= ЛОЖЬ;
		Элементы.СотрудникиГруппаСписаниеОтпусков.Видимость 			= ЛОЖЬ;
		Элементы.СотрудникиГруппаПериод.Видимость                       = Истина;
		Элементы.СотрудникиПрежнееПодразделение.Видимость               = Истина;
		Элементы.ГруппаДолжность.Видимость                              = Истина;
		Элементы.ГруппаСтавок.Видимость                                 = Истина;
		Элементы.ГруппаГрафик.Видимость                                 = Истина;
		Элементы.ГруппаУчастникПенсионногоФонда.Видимость               = Истина;
		Элементы.ГруппаВидУдержанияПФ.Видимость                         = Истина;
		Элементы.ГруппаУчаствуетДобровольно.Видимость                   = Истина;
		Элементы.ЗаполнитьПоОстаткамОтпусков.Видимость                  = ЛОЖЬ;
		//--- Дмгг Таск ONESOFT-2766 08.12.22
		
	//+++ Дмгг Таск ONESOFT-2766 08.12.22
	ИначеЕсли ЭтоСписаниеОтпусков Тогда
	
		Элементы.СтраницаНачисленияУдержания.Видимость 					= ЛОЖЬ;
		Элементы.СтраницаНалоги.Видимость 								= ЛОЖЬ;
		Элементы.ГруппаСписанияОтпусков.Видимость 						= Истина;
		Элементы.СотрудникиГруппаСписаниеОтпусков.Видимость 			= Истина;
		Элементы.СотрудникиГруппаПериод.Видимость                       = ЛОЖЬ;
		Элементы.СотрудникиПрежнееПодразделение.Видимость               = ЛОЖЬ;
		Элементы.ГруппаДолжность.Видимость                              = ЛОЖЬ;
		Элементы.ГруппаСтавок.Видимость                                 = ЛОЖЬ;
		Элементы.ГруппаГрафик.Видимость                                 = ЛОЖЬ;
		Элементы.ГруппаУчастникПенсионногоФонда.Видимость               = ЛОЖЬ;
		Элементы.ГруппаВидУдержанияПФ.Видимость                         = ЛОЖЬ;
		Элементы.ГруппаУчаствуетДобровольно.Видимость                   = ЛОЖЬ;
		Элементы.ЗаполнитьПоОстаткамОтпусков.Видимость                  = Истина;
		
	ИначеЕсли ЭтоВидыОтпусков Тогда
	
		Элементы.СотрудникиГруппаПериод.Видимость 						= Истина;
		Элементы.СотрудникиДатаОкончанияДоговора.Видимость              = ЛОЖЬ;
		Элементы.ГруппаПодразделение.Видимость							= ЛОЖЬ;
		Элементы.ГруппаДолжность.Видимость		 						= ЛОЖЬ;
		Элементы.ГруппаСтавок.Видимость						 			= ЛОЖЬ;
		Элементы.ГруппаГрафик.Видимость 			                    = ЛОЖЬ;
		Элементы.ГруппаУчастникПенсионногоФонда.Видимость               = ЛОЖЬ;
		Элементы.ГруппаВидУдержанияПФ.Видимость                         = ЛОЖЬ;
		Элементы.ГруппаУчаствуетДобровольно.Видимость                   = ЛОЖЬ;
		Элементы.СотрудникиГруппаСписаниеОтпусков.Видимость             = Истина;
		Элементы.СотрудникиВидыОтпусков.Видимость 		                = Истина;
		Элементы.КоличествоДней.Видимость                         		= ЛОЖЬ;
		Элементы.ГруппаСписанияОтпусков.Видимость                   	= ЛОЖЬ;
		Элементы.СтраницаНалоги.Видимость                               = ЛОЖЬ;
		Элементы.СтраницаНачисленияУдержания.Видимость                  = ЛОЖЬ;
		Элементы.ЗаполнитьПоОстаткамОтпусков.Видимость                  = ЛОЖЬ;
	//--- Дмгг Таск ONESOFT-2766 08.12.22
	Иначе
		
		Элементы.СотрудникиПрежнееКоличествоЗанимаемыхСтавок.Видимость	= Ложь;
		Элементы.СотрудникиЗанимаемыхСтавок.Видимость					= Ложь;
		//+++ Дмгг Таск ONESOFT-2766 08.12.22
		Элементы.СтраницаНачисленияУдержания.Видимость 					= Истина;
		Элементы.СтраницаНалоги.Видимость 								= Истина;
		Элементы.ГруппаСписанияОтпусков.Видимость 						= ЛОЖЬ;
		Элементы.СотрудникиГруппаСписаниеОтпусков.Видимость 			= ЛОЖЬ;
		Элементы.СотрудникиГруппаПериод.Видимость                       = Истина;
		Элементы.СотрудникиПрежнееПодразделение.Видимость               = Истина;
		Элементы.ГруппаДолжность.Видимость                              = Истина;
		Элементы.ГруппаСтавок.Видимость                                 = Истина;
		Элементы.ГруппаГрафик.Видимость                                 = Истина;
		Элементы.ГруппаУчастникПенсионногоФонда.Видимость               = Истина;
		Элементы.ГруппаВидУдержанияПФ.Видимость                         = Истина;
		Элементы.ГруппаУчаствуетДобровольно.Видимость                   = Истина;
		Элементы.ЗаполнитьПоОстаткамОтпусков.Видимость                  = ЛОЖЬ;
		//--- Дмгг Таск ONESOFT-2766 08.12.22
		
	конецЕсли;
	
КонецПроцедуры // УстановитьВидимостьНаСервере()

&НаСервере
// Процедура инициализирует управление видимость 
// и заполние вычисляемых значений на сервере
//
Процедура ОбработатьСобытиеНаСервере(УстановитьВидимость = Истина, ЗаполнитьЗначения = Истина)
	
	Если УстановитьВидимость Тогда
		
		УстановитьВидимостьНаСервере();
		
	КонецЕсли;
	
	Если ЗаполнитьЗначения Тогда
		
		ЗаполнитьЗначения();
		
	КонецЕсли;
	
КонецПроцедуры //ОбработатьСобытиеНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	ИмяТабличнойЧасти = "Сотрудники";
	ВалютаПоУмолчанию = Константы.НациональнаяВалюта.Получить();
	
	ВестиШтатноеРасписание = Константы.ФункциональнаяОпцияВестиШтатноеРасписание.Получить();
	
	ОбработатьСобытиеНаСервере();
	
	Если НЕ Константы.ФункциональнаяОпцияИспользоватьСовместительство.Получить() Тогда
		
		Если Элементы.Найти("СотрудникиСотрудникКод") <> Неопределено Тогда
			
			Элементы.СотрудникиСотрудникКод.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
	ОсновноеПодразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить() Тогда
		Элементы.СотрудникиПрежнееПодразделение.Видимость = Ложь;
	КОнецЕсли;
	
	УчетНалогов = ПолучитьФункциональнуюОпцию("ВестиУчетНалогаНаДоходыИВзносов");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТекущийСотрудникНалоги", "Видимость", УчетНалогов);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
// Процедура - обработчик события ПослеЗаписиНаСервере.
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбработатьСобытиеНаСервере();
	ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	
КонецПроцедуры //ПослеЗаписиНаСервере()


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеПоКадровомуУчету");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРеквизитовШапки

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
Процедура ДатаПриИзменении(Элемент)
	
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДатаПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Организация.
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
Процедура ОрганизацияПриИзменении(Элемент)

	// Обработка события изменения организации.
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация);
	Компания = СтруктураДанные.Компания;
	
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода ВидОперации.
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
Процедура ВидОперацииПриИзменении(Элемент)
	
	ОбработатьСобытиеНаСервере(,Ложь);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты") Тогда
	
		Для каждого СтрокаТЧ Из Объект.Сотрудники Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ПрежнееПодразделение)
				ИЛИ ЗначениеЗаполнено(СтрокаТЧ.ПрежняяДолжность) Тогда
				
				ЗаполнитьЗначенияПоВсемСотрудникам();
				Прервать;
			
			КонецЕсли;
			
		КонецЦикла;
		
	//+++ Дмгг Таск ONESOFT-2766 08.12.22
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКадровоеПеремещение.СписаниеДнейОтпуска") Тогда
		УстановитьВидимостьНаСервере();
	//--- Дмгг Таск ONESOFT-2766 08.12.22
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриСменеСтраницы поля СтраницыОсновная
//
Процедура СтраницыОсновнаяПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаНачисленияУдержания
		ИЛИ ТекущаяСтраница = Элементы.СтраницаНалоги Тогда
		
		ЗаполнитьСписокВыбораТекущихСотрудников();
		
		ДанныеТекущейСтроки = Элементы.Сотрудники.ТекущиеДанные;
		
		Если ДанныеТекущейСтроки <> Неопределено Тогда
			
			ТекущийСотрудник = ДанныеТекущейСтроки.ПолучитьИдентификатор();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // СтраницыОсновнаяПриСменеСтраницы()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ТекущийСотрудникНачисленияУдержания
//
Процедура ТекущийСотрудникНачисленияУдержанияПриИзменении(Элемент)
	
	ИзменитьТекущегоСотрудника();
	
КонецПроцедуры // ТекущийСотрудникНачисленияУдержанияПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ТекущийСотрудникНалоги
//
Процедура ТекущийСотрудникНалогиПриИзменении(Элемент)
	
	ИзменитьТекущегоСотрудника();
	
КонецПроцедуры // ТекущийСотрудникНалогиПриИзменении()

&НаКлиенте
Процедура ЗаполнитьНачисленияУдержания(Команда)	
	
	СтрокаТабличнойЧасти = Элементы.Сотрудники.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='არ არის არჩეული ცხრილის ნაწილ ""თანამშრომლების"" სტრიქონი!';ru='Не выбрана строка табличной части ""Сотрудники""!';en='Not selected line of the table ""Employees""!'");
		Сообщение.Сообщить();	
		Возврат;
		
	КонецЕсли;  
	
	Если Объект.НачисленияУдержания.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаТабличнойЧасти.КлючСвязи)).Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНачисленияУдержанияЗавершение", ЭтотОбъект, Новый Структура("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти)), НСтр("ka='ცხრილი ""დარიცხვები და დაკავებები"" გასუფთავდება! გავაგრძელოთ ოპერაციის შესრულება?';ru='Табличная часть ""Начисления и удержания"" будет очищена! Продолжить выполнение операции?';en='Tabular section ""Charges and hold"" will be cleared! To continue the operation?'"), РежимДиалогаВопрос.ДаНет, 0);
        Возврат; 
	КонецЕсли;
	
	ЗаполнитьНачисленияУдержанияФрагмент(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачисленияУдержанияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    СтрокаТабличнойЧасти = ДополнительныеПараметры.СтрокаТабличнойЧасти;
    
    
    Ответ = Результат;
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли; 
    
    ЗаполнитьНачисленияУдержанияФрагмент(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачисленияУдержанияФрагмент(Знач СтрокаТабличнойЧасти)
    
    Перем НоваяСтрока, РезультатПоиска, СтрокаПоиска, СтрОтбора, СтруктураОтбора;
    
    УправлениеНебольшойФирмойКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтаФорма, "НачисленияУдержания");
    
    СтруктураОтбора = Новый Структура;
    СтруктураОтбора.Вставить("Сотрудник", 	СтрокаТабличнойЧасти.Сотрудник);
    СтруктураОтбора.Вставить("Организация", Объект.Организация);
    СтруктураОтбора.Вставить("Дата", 		СтрокаТабличнойЧасти.Период);		
    РезультатПоиска = НайтиНачисленияУдержанияСотрудникаСервер(СтруктураОтбора);
    
    Для каждого СтрокаПоиска Из РезультатПоиска Цикл
        НоваяСтрока 						= Объект.НачисленияУдержания.Добавить();
        НоваяСтрока.ВидНачисленияУдержания 	= СтрокаПоиска.ВидНачисленияУдержания;		
        НоваяСтрока.Сумма 					= СтрокаПоиска.Сумма;
        НоваяСтрока.Валюта 					= СтрокаПоиска.Валюта;
		Если Не ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
			НоваяСтрока.СчетЗатрат			 	= СтрокаПоиска.СчетЗатрат;
		КонецЕсли;
		НоваяСтрока.СчетЗатратРегл			 	= СтрокаПоиска.СчетЗатратРегл;
        НоваяСтрока.Актуальность			= СтрокаПоиска.Актуальность;
        НоваяСтрока.КлючСвязи 				= СтрокаТабличнойЧасти.КлючСвязи;
    КонецЦикла;	
    
    СтрОтбора = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТабличнойЧасти.КлючСвязи);
    Элементы.НачисленияУдержания.ОтборСтрок 	= СтрОтбора;
	СотрудникиПериодПриИзменении(Неопределено);//Паганини

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНалогиНаДоходы(Команда)	
	
	СтрокаТабличнойЧасти = Элементы.Сотрудники.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='არ არის არჩეული ცხრილის ნაწილ ""თანამშრომლების"" სტრიქონი!';ru='Не выбрана строка табличной части ""Сотрудники""!';en='Not selected line of the table ""Employees""!'");
		Сообщение.Сообщить();	
		Возврат;
		
	КонецЕсли;  
	
	Если Объект.НалогиНаДоходы.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаТабличнойЧасти.КлючСвязи)).Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНалогиНаДоходыЗавершение", ЭтотОбъект, Новый Структура("СтрокаТабличнойЧасти", СтрокаТабличнойЧасти)), НСтр("ka='ცხრილი ""საშემოსავლო გადასახადები"" გასუფთავდება! გავაგრძელოთ ოპერაციის შესრულება?';ru='Табличная часть ""Налоги на доходы"" будет очищена! Продолжить выполнение операции?';en='Tabular part of the ""Income taxes"" will be cleared! To continue the operation?'"), РежимДиалогаВопрос.ДаНет, 0);
        Возврат; 
	КонецЕсли;
	
	ЗаполнитьНалогиНаДоходыФрагмент(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНалогиНаДоходыЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    СтрокаТабличнойЧасти = ДополнительныеПараметры.СтрокаТабличнойЧасти;
    
    
    Ответ = Результат;
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли; 
    
    ЗаполнитьНалогиНаДоходыФрагмент(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНалогиНаДоходыФрагмент(Знач СтрокаТабличнойЧасти)
    
    Перем НоваяСтрока, РезультатПоиска, СтрокаПоиска, СтрОтбора, СтруктураОтбора;
    
    УправлениеНебольшойФирмойКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтаФорма, "НалогиНаДоходы");
    
    СтруктураОтбора = Новый Структура;
    СтруктураОтбора.Вставить("Сотрудник", 	СтрокаТабличнойЧасти.Сотрудник);
    СтруктураОтбора.Вставить("Организация", Объект.Организация);
    СтруктураОтбора.Вставить("Дата", 		СтрокаТабличнойЧасти.Период);		
    РезультатПоиска = НайтиНачисленияУдержанияСотрудникаСервер(СтруктураОтбора, Истина);
    
    Для каждого СтрокаПоиска Из РезультатПоиска Цикл
        НоваяСтрока 						= Объект.НалогиНаДоходы.Добавить();
        НоваяСтрока.ВидНачисленияУдержания 	= СтрокаПоиска.ВидНачисленияУдержания;		
        НоваяСтрока.Валюта 					= СтрокаПоиска.Валюта;
        НоваяСтрока.Актуальность			= СтрокаПоиска.Актуальность;
        НоваяСтрока.КлючСвязи 				= СтрокаТабличнойЧасти.КлючСвязи;
    КонецЦикла;	
    
    СтрОтбора = Новый ФиксированнаяСтруктура("КлючСвязи", СтрокаТабличнойЧасти.КлючСвязи);
    Элементы.НалогиНаДоходы.ОтборСтрок 	= СтрОтбора;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриАктивизации строки табличной части Сотрудники.
//
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
		
	УправлениеНебольшойФирмойКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтаФорма, "НачисленияУдержания");
	УправлениеНебольшойФирмойКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтаФорма, "НалогиНаДоходы");
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриНачалеРедактирования табличной части Сотрудники.
//
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда

		УправлениеНебольшойФирмойКлиент.ДобавитьКлючСвязиВСтрокуТабличнойЧасти(ЭтаФорма);
		УправлениеНебольшойФирмойКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтаФорма, "НачисленияУдержания");
		УправлениеНебольшойФирмойКлиент.УстановитьОтборНаПодчиненнуюТабличнуюЧасть(ЭтаФорма, "НалогиНаДоходы");
		
		СтрокаТабличнойЧасти = Элементы.Сотрудники.ТекущиеДанные;
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПередУдалением табличной части Сотрудники.
//
Процедура СотрудникиПередУдалением(Элемент, Отказ)

	УправлениеНебольшойФирмойКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтаФорма, "НачисленияУдержания");
	УправлениеНебольшойФирмойКлиент.УдалитьСтрокиПодчиненнойТабличнойЧасти(ЭтаФорма, "НалогиНаДоходы");

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении Сотрудник табличной части Сотрудники.
//
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	ТекущиеДанные.Период = ТекущаяДата();
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСотрудник = Новый Структура();
	СтруктураСотрудник.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
	СтруктураСотрудник.Вставить("Период", ТекущиеДанные.Период);
	СтруктураСотрудник.Вставить("Организация", Объект.Организация);
	СтруктураСотрудник.Вставить("Ссылка", Объект.Ссылка);//Паганини
	
	ПолучитьДанныеСотрудника(СтруктураСотрудник);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураСотрудник);
		
	ТекущиеДанные.ПрежнееПодразделение = СтруктураСотрудник.СтруктурнаяЕдиница;
	ТекущиеДанные.ПрежняяДолжность = СтруктураСотрудник.Должность;
	ТекущиеДанные.ПрежнееКоличествоЗанимаемыхСтавок = СтруктураСотрудник.ЗанимаемыхСтавок;
	ТекущиеДанные.ПрежнийГрафикРаботы = СтруктураСотрудник.ГрафикРаботы;
	//Паганини ПФ_
	ТекущиеДанные.ПрежнийУчастникПенсионногоФонда		= СтруктураСотрудник.УчастникПенсионногоФонда;
	ТекущиеДанные.ПрежнийВидУдержанияПФ					= СтруктураСотрудник.ВидУдержанияПФ;
	ТекущиеДанные.ПрежнийУчаствуетДобровольно 			= СтруктураСотрудник.УчаствуетДобровольно;
	//_Паганини ПФ
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СтруктурнаяЕдиница) Тогда
		ТекущиеДанные.СтруктурнаяЕдиница = ОсновноеПодразделение;
	КонецЕсли;	
	
	ТекущиеДанные.ВидОтпуска = СтруктураСотрудник.ВидОтпуска; //+++ Дмгг
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении Период табличной части Сотрудники.
//
Процедура СотрудникиПериодПриИзменении(Элемент)
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	СтруктураСотрудник = Новый Структура();
	СтруктураСотрудник.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
	СтруктураСотрудник.Вставить("Период", ТекущиеДанные.Период);
	СтруктураСотрудник.Вставить("Организация", Объект.Организация);
	СтруктураСотрудник.Вставить("Ссылка", Объект.Ссылка);//Паганини
	
	ПолучитьДанныеСотрудника(СтруктураСотрудник);
	
	ТекущиеДанные.ПрежнееПодразделение = СтруктураСотрудник.СтруктурнаяЕдиница;
	ТекущиеДанные.ПрежняяДолжность = СтруктураСотрудник.Должность;
	ТекущиеДанные.ПрежнееКоличествоЗанимаемыхСтавок = СтруктураСотрудник.ЗанимаемыхСтавок;
	ТекущиеДанные.ПрежнийГрафикРаботы = СтруктураСотрудник.ГрафикРаботы;
	//Паганини_
	ТекущиеДанные.ПрежнийУчастникПенсионногоФонда		= СтруктураСотрудник.УчастникПенсионногоФонда;
	ТекущиеДанные.ПрежнийВидУдержанияПФ					= СтруктураСотрудник.ВидУдержанияПФ;
	ТекущиеДанные.ПрежнийУчаствуетДобровольно			= СтруктураСотрудник.УчаствуетДобровольно;
	//_Паганини
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СтруктурнаяЕдиница) И НЕ ЗначениеЗаполнено(ТекущиеДанные.Должность) И НЕ ЗначениеЗаполнено(ТекущиеДанные.ГрафикРаботы) Тогда	
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураСотрудник);	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриНачалеРедактирования табличной части НачисленияУдержания.
//
Процедура НачисленияУдержанияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		УправлениеНебольшойФирмойКлиент.ДобавитьКлючСвязиВСтрокуПодчиненнойТабличнойЧасти(ЭтаФорма, Элемент.Имя);
		СтрокаТабличнойЧасти = Элементы.НачисленияУдержания.ТекущиеДанные;
		СтрокаТабличнойЧасти.Валюта = ВалютаПоУмолчанию;
		СтрокаТабличнойЧасти.Актуальность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПередНачаломДобавления табличной части НачисленияУдержания.
//
Процедура НачисленияУдержанияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = УправлениеНебольшойФирмойКлиент.ПередНачаломДобавленияВПодчиненнуюТабличнуюЧасть(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении ВидНачисленияУдержания табличной части НачисленияУдержания.
//
Процедура НачисленияУдержанияВидНачисленияУдержанияПриИзменении(Элемент)
	Если Не ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
		УправлениеНебольшойФирмойКлиент.ПроставитьСчетЗатратПоУмолчанию(ЭтаФорма);
	Иначе
		УправлениеНебольшойФирмойКлиент.ПроставитьСчетЗатратПоУмолчаниюРегл(ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры // НачисленияУдержанияВидНачисленияУдержанияПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриНачалеРедактирования табличной части НалогиНаДоходы.
//
Процедура НалогиНаДоходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		УправлениеНебольшойФирмойКлиент.ДобавитьКлючСвязиВСтрокуПодчиненнойТабличнойЧасти(ЭтаФорма, Элемент.Имя);
		СтрокаТабличнойЧасти = Элементы.НалогиНаДоходы.ТекущиеДанные;
		СтрокаТабличнойЧасти.Валюта = ВалютаПоУмолчанию;
		СтрокаТабличнойЧасти.Актуальность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПередНачаломДобавления табличной части НалогиНаДоходы.
//
Процедура НалогиНаДоходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = УправлениеНебольшойФирмойКлиент.ПередНачаломДобавленияВПодчиненнуюТабличнуюЧасть(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ДекорацияПечатьНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиКадровоеПеремещение", Новый Структура("КонтекстПечати", Объект), ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

&НаКлиенте
Процедура СотрудникиУчастникПенсионногоФондаПриИзменении(Элемент)
	ТекДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если НЕ ТекДанные.УчастникПенсионногоФонда Тогда
		ТекДанные.ВидУдержанияПФ				= Неопределено;
		ТекДанные.УчаствуетДобровольно			= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

//+++ Дмгг Таск ONESOFT-2766 08.12.22
&НаСервере
Процедура ЗаполнитьПоОстаткамОтпусковНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьСотрудниковПоОстаткамОтпусков();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткамОтпусков(Команда)
	ЗаполнитьпоОстаткамОтпусковНаСервере();
КонецПроцедуры
//--- Дмгг Таск ONESOFT-2766 08.12.22
